### Summary
1. Convert a dictionary to a pandas dataframe
    * Source: https://www.delftstack.com/zh-tw/howto/python-pandas/how-to-convert-python-dictionary-to-pandas-dataframe/

In [1]:
import pandas as pd

### Q1: key & value are columns

In [3]:
fruit_dict = {
    3: 'apple',
    2: 'banana',
    6:'mango',
    4:'apricot',
    1:'kiwi',
    8:'orange'}

In [24]:
list(fruit_dict.items())

[(1, 'apple'),
 (2, 'banana'),
 (3, 'mango'),
 (4, 'apricot'),
 (5, 'kiwi'),
 (6, 'orange')]

In [5]:
pd.DataFrame(list(fruit_dict.items()), columns = ["Quantity", "Item"])

   Quantity     Item
0         3    apple
1         2   banana
2         6    mango
3         4  apricot
4         1     kiwi
5         8   orange

### Q2: key is the column and the value is the row

In [7]:
fruit_dict = {
    1: 'apple',
    2: 'banana',
    3:'mango',
    4:'apricot',
    5:'kiwi',
    6:'orange'}
pd.DataFrame([fruit_dict])

       1       2      3        4     5       6
0  apple  banana  mango  apricot  kiwi  orange

### Q3: nested dictionary

In [8]:
data = {
    '1':{
        'apple':11, 
        'banana':18}, 
    '2':{
        'apple':16, 
        'banana':12}
}

In [9]:
# Wrong
pd.DataFrame(list(data.items()))

   0                            1
0  1  {'apple': 11, 'banana': 18}
1  2  {'apple': 16, 'banana': 12}

In [12]:
# Wrong format
tmp = pd.DataFrame(list(data.items()))
pd.DataFrame.from_records(tmp[1])

   apple  banana
0     11      18
1     16      12

In [13]:
# Wrong
pd.DataFrame([data])

                             1                            2
0  {'apple': 11, 'banana': 18}  {'apple': 16, 'banana': 12}

In [14]:
# The format we want - breakdown
for k, v in data.items():
    print(k)
    print(v)

1
{'apple': 11, 'banana': 18}
2
{'apple': 16, 'banana': 12}

In [16]:
pd.Series({'apple': 11, 'banana': 18})

apple     11
banana    18
dtype: int64

In [18]:
data

{'1': {'apple': 11, 'banana': 18}, '2': {'apple': 16, 'banana': 12}}

In [19]:
{k: pd.Series(v) for k, v in data.items()}

{'1': apple     11
 banana    18
 dtype: int64,
 '2': apple     16
 banana    12
 dtype: int64}

In [21]:
pd.concat({k: pd.Series(v) for k, v in data.items()})

1  apple     11
   banana    18
2  apple     16
   banana    12
dtype: int64

In [22]:
pd.concat({k : pd.Series(v) for k, v in data.items()}).reset_index()

  level_0 level_1   0
0       1   apple  11
1       1  banana  18
2       2   apple  16
3       2  banana  12

In [23]:
# Finally
new = pd.concat({k: pd.Series(v) for k, v in data.items()}).reset_index()
new.columns = ["index", "item", "quantity"]
new

  index    item  quantity
0     1   apple        11
1     1  banana        18
2     2   apple        16
3     2  banana        12